
let arrlist=["1","2","3","4","5","6","7","8","9","13","14","19","20","21","22","23","24","26"]
let arrduanhao=  [1111, 2303, 1991, 4717, 5555, 6666, 8370, 6648, 9999, 5380,
    "11xx", "12xx", "13xx", "14xx", "15xx", 3472,"16xx","17xx","18xx","19xx","20xx",
    "21xx","23xx","24xx","25xx","26xx","27xx","28xx","29xx","30xx",
    "31xx"
]
let mgs=["凯嘉酒店","博莱酒店"]
let num=["dz1", "dz2", "dz3", "dz4", "dz5", "dz6", "dz7", "dz8", "dz9", "dz10",
    "dz11", "dz12", "dz13", "dz14", "dz15", "dz16", "dz17", "dz18", "dz19", "dz20",
    "dz21", "dz22","dz23","dz24","dz25","dz26","dz27","dz28","dz29","dz30","dz31"]
let addressList = [
    "广州市白云区龙归街道北太路奔力物流",
    "广州市白云区太和镇龙归街道夏良十六队",
    "广州市白云区龙归街道柏塘村草塘一路",
    "广州市白云区龙归街道柏塘村草塘路",
    "广州市白云区龙归街道柏塘村柏兴东路",
    "广州市白云区龙归街道柏塘村绿地云央小区1栋-13栋",
    "广州市白云区龙归街道柏塘村柏兴中路",
    "广州市白云区龙归街道柏塘村柏新东路",
    "广州市白云区龙归街道柏塘村柏塘一路",
    "广州市白云区龙归街道柏塘村柏塘二路",
    "广州市白云区龙归街道柏塘村柏新西路",
    "广州市白云区龙归街道柏塘村龙凤花园小区",
    "广州市白云区龙归街道柏塘村草塘街",
    "广州市白云区龙归街道柏塘村草塘一路",
    "广州市白云区龙归街道绿地云央小区",
    "广州市白云区龙归街道柏塘村聚龙街",
    "广州市白云区龙归街道长庚路",
    "广州市白云区龙归街道科泰二路产业创新园",
    "广州市白云区龙归街道云正大道1112号通达电气",
    "广州市白云区龙归街道民营科技园晟启能源",
    "广州市白云区太和镇营溪村",
    "广州市白云区太和镇兴和市场",
    "广州市白云区龙归街道夏良村十六队永泰庄",
    "广州市白云区龙归街绿地柏玥晶舍",
    "广州市白云区龙归街道柏塘村云正大道",
    "广州市白云区龙归街道柏塘村柏圣街"
];

const communityArray = [     "凤凰小区",     "牡丹小区",     "紫薇小区",     "丁香小区",     "瑞景小区",     "福满小区",     "锦绣小区",     "康泰小区",     "和谐小区",     "温馨小区" ];


let rname = [
    //01 ab
    ["安", "艾"],
    ["白", "包", "柏", "卜", "步", "巴", "毕", "边", "卞", "邴"],

//23 cd
    ["陈", "曹", "崔", "程", "常", "成", "昌", "巢", "储", "车", "充"],
    ["戴", "邓", "丁", "董", "杜", "段", "狄"],
    [],

//56 fg
    ["冯", "方", "范", "费", "傅", "符", "伏", "扶", "凤", "封", "丰", "房"],
    ["高", "郭", "葛", "顾", "甘", "戈", "盖", "宫", "龚", "贡", "耿", "关", "桂", "巩", "公", "弓"],

//79 hj
    ["黄", "何", "胡", "贺", "霍", "洪", "韩", "华", "郝", "侯", "和", "赫", "红", "海", "杭", "怀"],
    [],
    ["蒋", "姜", "贾", "金", "江", "季", "嵇", "吉", "简", "焦", "景", "姬", "籍", "靳"],

//10 11 kl
    ["孔", "康", "柯", "寇", "空", "蒯", "匡", "阚"],
    ["李", "刘", "吕", "梁", "卢", "廖", "林", "陆", "龙", "雷", "赖", "娄", "凌", "路", "栾", "黎", "廉", "蔺", "厉", "隆"],
//12 13 mn o
    ["马", "孟", "穆", "毛", "梅", "莫", "牧", "闵"],
    ["倪", "宁", "牛", "聂"],
    [],
//15 16 17 pqr
    ["潘", "彭", "庞", "皮", "裴"],
    ["钱", "秦", "戚", "齐", "乔", "屈", "祁", "邱", "曲"],
    ["任", "阮", "荣", "芮", "饶"],
//18 19st
    ["孙", "宋", "苏", "沈", "施", "邵", "石", "时", "盛", "水", "单", "沙", "山", "商", "桑", "尚", "韶"],
    ["陶", "唐", "汤", "滕", "谭"],

    [],
    [],
    //22 23 wx
    ["王", "吴", "卫", "魏", "汪", "韦", "万", "武", "温", "文", "闻", "伍", "乌", "蔚", "隗"],
    ["徐", "许", "谢", "薛", "夏", "萧", "熊", "胥", "邢", "辛", "解", "宣", "项", "席", "咸", "相"],
//24 25 yz
    ["杨", "严", "尤", "于", "俞", "袁", "尹", "姚", "余", "叶", "阎", "殷", "岳", "禹", "喻", "庾", "郁", "元", "乐", "越"],
    ["赵", "周", "郑", "朱", "张", "钟", "章", "邹", "詹", "臧"]
]